In [1]:
#Pandas Day1
import pandas as pd

In [8]:
marks=[78,80,67]
marks

[78, 80, 67]

In [9]:
#To create Series in Pandas
df=pd.Series(marks)
df

0    78
1    80
2    67
dtype: int64

In [16]:
names=['adc','xyz','efg']
names

['adc', 'xyz', 'efg']

In [20]:
#To create DataFrame in series
student={'Studentname':names,'Marks':marks}
df=pd.DataFrame(student)
df

  Studentname  Marks
0         adc     78
1         xyz     80
2         efg     67

In [21]:
#To change index 
de=pd.DataFrame(student,index=['a','b','c'])
de

  Studentname  Marks
a         adc     78
b         xyz     80
c         efg     67

In [22]:
#Shape of DataFrame
df.shape

(3, 2)

In [25]:
#To get information without Table
df.info

<bound method DataFrame.info of   Studentname  Marks
0         adc     78
1         xyz     80
2         efg     67>

In [26]:
df.describe

<bound method NDFrame.describe of   Studentname  Marks
0         adc     78
1         xyz     80
2         efg     67>

In [27]:
#To print top 5 rows of DF
df.head()

  Studentname  Marks
0         adc     78
1         xyz     80
2         efg     67

In [28]:
##To print top 2 rows of DF
df.head(2)

  Studentname  Marks
0         adc     78
1         xyz     80

In [29]:
##To print last 2 rows of DF
df.tail(2)

  Studentname  Marks
1         xyz     80
2         efg     67

In [32]:
df.tail(1)

  Studentname  Marks
2         efg     67

In [45]:
#To print data Direct Excell Data
dg=pd.read_csv('student.csv')
dg

    Roll No.    Names  Age  Marks
0          1      jay   23     78
1          2    vivek   22     86
2          3     raju   24     78
3          4     deep   25     56
4          5      dev   23     64
5          6  rushabh   21     53
6          7    tirth   28     57
7          8   dharil   29     69
8          9   prince   30     89
9         10    rajvi   32     87
10        11    nancy   21     67
11        12    harsh   22     63
12        13    vijay   20     52
13        14   harish   26     45
14        15   jayesh   18     67
15        16    foram   20     80
16        17   paresh   43     88
17        18   preyas   45     60
18        19   aashay   42     66
19        20  shubham   19     65

In [43]:
dg.shape

(20, 4)

In [44]:
dg.size

80

In [47]:
type(dg)

pandas.core.frame.DataFrame

In [49]:
dg.head(5)

   Roll No.  Names  Age  Marks
0         1    jay   23     78
1         2  vivek   22     86
2         3   raju   24     78
3         4   deep   25     56
4         5    dev   23     64

In [51]:
dg.tail(5)

    Roll No.    Names  Age  Marks
15        16    foram   20     80
16        17   paresh   43     88
17        18   preyas   45     60
18        19   aashay   42     66
19        20  shubham   19     65

In [56]:
dg.columns

Index(['Roll No.', 'Names', 'Age', 'Marks'], dtype='object')

In [60]:
dg['Names']

0         jay
1       vivek
2        raju
3        deep
4         dev
5     rushabh
6       tirth
7      dharil
8      prince
9       rajvi
10      nancy
11      harsh
12      vijay
13     harish
14     jayesh
15      foram
16     paresh
17     preyas
18     aashay
19    shubham
Name: Names, dtype: object

In [63]:
#To print multiple columns
dg[["Names","Marks"]]

      Names  Marks
0       jay     78
1     vivek     86
2      raju     78
3      deep     56
4       dev     64
5   rushabh     53
6     tirth     57
7    dharil     69
8    prince     89
9     rajvi     87
10    nancy     67
11    harsh     63
12    vijay     52
13   harish     45
14   jayesh     67
15    foram     80
16   paresh     88
17   preyas     60
18   aashay     66
19  shubham     65

In [61]:
dg.info

<bound method DataFrame.info of     Roll No.    Names  Age  Marks
0          1      jay   23     78
1          2    vivek   22     86
2          3     raju   24     78
3          4     deep   25     56
4          5      dev   23     64
5          6  rushabh   21     53
6          7    tirth   28     57
7          8   dharil   29     69
8          9   prince   30     89
9         10    rajvi   32     87
10        11    nancy   21     67
11        12    harsh   22     63
12        13    vijay   20     52
13        14   harish   26     45
14        15   jayesh   18     67
15        16    foram   20     80
16        17   paresh   43     88
17        18   preyas   45     60
18        19   aashay   42     66
19        20  shubham   19     65>

In [62]:
dg.describe

<bound method NDFrame.describe of     Roll No.    Names  Age  Marks
0          1      jay   23     78
1          2    vivek   22     86
2          3     raju   24     78
3          4     deep   25     56
4          5      dev   23     64
5          6  rushabh   21     53
6          7    tirth   28     57
7          8   dharil   29     69
8          9   prince   30     89
9         10    rajvi   32     87
10        11    nancy   21     67
11        12    harsh   22     63
12        13    vijay   20     52
13        14   harish   26     45
14        15   jayesh   18     67
15        16    foram   20     80
16        17   paresh   43     88
17        18   preyas   45     60
18        19   aashay   42     66
19        20  shubham   19     65>

In [66]:
#To print individual row
dg.iloc[2]

Roll No.       3
Names       raju
Age           24
Marks         78
Name: 2, dtype: object

In [67]:
dg.iloc[4:9]

   Roll No.    Names  Age  Marks
4         5      dev   23     64
5         6  rushabh   21     53
6         7    tirth   28     57
7         8   dharil   29     69
8         9   prince   30     89

In [69]:
#To print first 3
dg.head(3)

   Roll No.  Names  Age  Marks
0         1    jay   23     78
1         2  vivek   22     86
2         3   raju   24     78

In [72]:
#To print last 3
dg.tail(3)

    Roll No.    Names  Age  Marks
17        18   preyas   45     60
18        19   aashay   42     66
19        20  shubham   19     65